Revit 2027 API
ElectricalAnalyticalNode.NodeType Property
 The type of electrical analytical node.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElectricalAnalyticalNodeType NodeType { get; }
Public ReadOnly Property NodeType As ElectricalAnalyticalNodeType
	Get
public:
property ElectricalAnalyticalNodeType NodeType {
	ElectricalAnalyticalNodeType get ();
}
member NodeType : ElectricalAnalyticalNodeType with get
Property Value
ElectricalAnalyticalNodeType
See Also
Reference
ElectricalAnalyticalNode Class
Autodesk.Revit.DB.Electrical Namespace